{
  "lastUpdated": "April 19, 2025 – 08:22 PM",
  "news": {
    "title": "Top News",
    "items": [
      "Union Square's Taj Campton Place steps up SF's modern Indian renaissance.",
      "31 Of The Most Brain-Scrambling “Today I Learned” Facts (New Facts)",
      "Star Wars Outlaws demo arrives well after launch, ahead of Switch 2 debut",
      "Surrey, B.C., gears up for biggest Vaisakhi parade in Canada",
      "*ONLY ON* Tall Tales: Jonathan Zawada Defies Cliché in Thom Yorke’s Anxious Universe – Pt 1"
    ]
  },
  "sports": {
    "title": "Sports Updates",
    "items": [
      "Seiko’s Green Mojito Machine: The SRPE45 That Refuses to Be Ordinary",
      "Double-Serving Ice Cream Bars - Snickers Ice Cream x Travis Hunter Two-Pack Celebrates the Athlete (TrendHunter.com)",
      "I prioritized family time when my son was little. I'm so proud to see him do the same with his family.",
      "Rays summon Chandler Simpson to majors with Richie Palacios hurt again",
      "New Superman Footage Features One of DC’s Weirdest Heroes"
    ]
  },
  "entertainment": {
    "title": "Entertainment Buzz",
    "items": [
      "iHostage — When a gunman enters an Apple Store in the heart of Amsterdam, the police face a delicate challenge ...",
      "Captain America: Brave New World — After meeting with newly elected U.S. President Thaddeus Ross, Sam finds himself in the middle of an...",
      "Sinners — Trying to leave their troubled lives behind, twin brothers return to their hometown to start again, ...",
      "A Working Man — Levon Cade left behind a decorated military career in the black ops to live a simple life working co...",
      "Novocaine — When the girl of his dreams is kidnapped, everyman Nate turns his inability to feel pain into an une..."
    ]
  },
  "weather": {
    "title": "Weather Today",
    "items": [
      "Delhi: 29.05°C, haze",
      "Hyderabad: 27.73°C, haze"
    ]
  },
  "quote": {
    "title": "Quote of the Day",
    "content": "Could not fetch quote today."
  },
  "fact": {
    "title": "Quick Fact",
    "content": "Could not fetch fact today."
  },
  "history": {
    "title": "Today in History",
    "content": "Could not fetch historical event today."
  },
  "trends": {
    "title": "Top Social Trends",
    "items": [
      "#WhatHappenedToday",
      "#NewsUpdate",
      "#India",
      "#World",
      "#Inspiration"
    ]
  }
}