{
  "lastUpdated": "April 19, 2025 – 08:46 PM",
  "news": {
    "title": "Top News",
    "items": [
      "Russia Removes Taliban from Terrorism List",
      "Motion for Preliminary Injunction, Temporary Restraining Order, and Summary Judgement in Our Case Against Trump's \"Liberation Day\" Tariffs",
      "The Cybersecurity Risk Of Ignoring Trump’s Attack On Chris Krebs",
      "Stream It Or Skip It: ‘Mickey 17’ on VOD, Bong Joon Ho’s Wackadoo Sci-fi Lark Offering Up a Double Dose of Robert Pattinson",
      "LIVE! PFL World Tournament 3 Highlights, Streaming Updates!"
    ]
  },
  "sports": {
    "title": "Sports Updates",
    "items": [
      "‘A day for them’: Ashland Special Olympics features talented student-athletes",
      "Available Now: Hisense U8QG MiniLED QLED Series — The Visual Focal Point of Your Home",
      "Gregg Popovich has medical incident in restaurant, is resting at home, AP source says",
      "Luka Doncic Had Violent First Reaction to Lakers' Trade"
    ]
  },
  "entertainment": {
    "title": "Entertainment Buzz",
    "items": [
      "iHostage — When a gunman enters an Apple Store in the heart of Amsterdam, the police face a delicate challenge ...",
      "Captain America: Brave New World — After meeting with newly elected U.S. President Thaddeus Ross, Sam finds himself in the middle of an...",
      "Sinners — Trying to leave their troubled lives behind, twin brothers return to their hometown to start again, ...",
      "A Working Man — Levon Cade left behind a decorated military career in the black ops to live a simple life working co...",
      "Mickey 17 — Unlikely hero Mickey Barnes finds himself in the extraordinary circumstance of working for an employ..."
    ]
  },
  "weather": {
    "title": "Weather Today",
    "items": [
      "Delhi: 29.05°C, haze",
      "Hyderabad: 27.73°C, haze"
    ]
  },
  "quote": {
    "title": "Quote of the Day",
    "content": "Could not fetch quote today."
  },
  "fact": {
    "title": "Quick Fact",
    "content": "Could not fetch fact today."
  },
  "history": {
    "title": "Today in History",
    "content": "Could not fetch historical event today."
  },
  "trends": {
    "title": "Top Social Trends",
    "items": [
      "#WhatHappenedToday",
      "#NewsUpdate",
      "#India",
      "#World",
      "#Inspiration"
    ]
  }
}