{
  "lastUpdated": "April 19, 2025 – 09:15 PM",
  "news": {
    "title": "Top News",
    "items": [
      "The White Lotus All-Stars: These Are The 8 Characters & Actors I'd Most Want To See Return",
      "On theCUBE Pod: Google and Meta under fire, startups surge, Saleforce’s Marc Benioff to talk AI strategy with theCUBE",
      "4/23/25: “World Book Day” at The American Bookbinders Museum (SF) - FREE",
      "4/23/25: The American Bookbinders Museum Unveils “The Banned Books Jail” (SF) - FREE",
      "Introduction to GitHub Actions Part 2: GitHub-hosted runners"
    ]
  },
  "sports": {
    "title": "Sports Updates",
    "items": [
      "Police preparing for protests, street takeovers in Portland this weekend",
      "2025 NFL Draft position rankings: LBs group a little thin overall, but not at the very top",
      "Healthletic Methylene Blue Drops Under Review: Best USP-Grade Pure Liquid Brand on the Market",
      "Man Utd, Liverpool Express Major Concern Over £63M-Rated Tottenham, PSG-Linked Attacker",
      "Pro-trans athlete protesters chant 'Hail Satan!' at girls during California school board meeting"
    ]
  },
  "entertainment": {
    "title": "Entertainment Buzz",
    "items": [
      "iHostage — When a gunman enters an Apple Store in the heart of Amsterdam, the police face a delicate challenge ...",
      "Captain America: Brave New World — After meeting with newly elected U.S. President Thaddeus Ross, Sam finds himself in the middle of an...",
      "Sinners — Trying to leave their troubled lives behind, twin brothers return to their hometown to start again, ...",
      "A Working Man — Levon Cade left behind a decorated military career in the black ops to live a simple life working co...",
      "Mickey 17 — Unlikely hero Mickey Barnes finds himself in the extraordinary circumstance of working for an employ..."
    ]
  },
  "weather": {
    "title": "Weather Today",
    "items": [
      "Delhi: 29.05°C, haze",
      "Hyderabad: 27.73°C, haze"
    ]
  },
  "quote": {
    "title": "Quote of the Day",
    "content": "Could not fetch quote today."
  },
  "fact": {
    "title": "Quick Fact",
    "content": "Could not fetch fact today."
  },
  "history": {
    "title": "Today in History",
    "content": "Could not fetch historical event today."
  },
  "trends": {
    "title": "Top Social Trends",
    "items": [
      "#WhatHappenedToday",
      "#NewsUpdate",
      "#India",
      "#World",
      "#Inspiration"
    ]
  }
}